In [1]:
#데이터 프레임은 series들의 모음이다 
#
import pandas as pd

tup_data = ('영인', '2010-05-01', '여', True)
sr = pd.Series(tup_data, index=['이름', '생년월일', '성별', '학생여부'])
print(sr)

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

In [3]:
print(sr[[0, 2]])
print(sr[['생년월일', '성별']])

print('----------------------')
print(sr[0 : 2])
print(sr['생년월일' : '성별'])

이름    영인
성별     여
dtype: object
생년월일    2010-05-01
성별               여
dtype: object
----------------------
이름              영인
생년월일    2010-05-01
dtype: object
생년월일    2010-05-01
성별               여
dtype: object

In [4]:
import pandas as pd

dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

df = pd.DataFrame(dict_data)

print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [5]:
print(df)

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [6]:
df = pd.DataFrame([[15, '남', '덕영중'], [17, '여', '수리중']])

In [7]:
df

    0  1    2
0  15  남  덕영중
1  17  여  수리중

In [8]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [9]:
#index로 바꾸기
df.index = ['학생1','학생2']

In [10]:
df

      0  1    2
학생1  15  남  덕영중
학생2  17  여  수리중

In [12]:
df.rename(index={'학생1':'하용'})

      0  1    2
하용   15  남  덕영중
학생2  17  여  수리중

In [17]:
df.rename(columns={'2':'학교명'})

#왜 안바뀌지???...

      0  1    2
학생1  15  남  덕영중
학생2  17  여  수리중

In [15]:
df

      0  1    2
학생1  15  남  덕영중
학생2  17  여  수리중

In [18]:
df

      0  1    2
학생1  15  남  덕영중
학생2  17  여  수리중

In [19]:
df.rename(columns={'0':'나이'}, inplace = True)

In [29]:
df



#아... 컬럼을 따로 지정해줘야한다.. 
columns = ['나이', '성별', '학교']

In [30]:
df.columns

Int64Index([0, 1, 2], dtype='int64')

In [31]:
df

      0  1    2
학생1  15  남  덕영중
학생2  17  여  수리중

In [35]:
exam_data = {'수학' : [ 90, 80, 70], '영어' : [ 98, 89, 95], '음악' : [ 85, 95, 100], '체육' : [ 100, 90, 90]}

In [33]:
df_1 = exam_data

In [36]:
df_1 = pd.DataFrame(df_1, index=['서준', '우현', '인아'])

In [37]:
df_1

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [38]:
#data frame 복제하기!~!~!~!
df2 = df_1[:]

In [40]:
df2
#good ㅎㅎ

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [41]:
df2.drop(['우현', '인아'], axis=0, inplace=True)
print(df2)

    수학  영어  음악   체육
서준  90  98  85  100

C:\Users\dkfl4\Anaconda3\lib\site-packages\pandas\core\frame.py:4312: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [42]:
df_1.iloc(0)

#### 라벨에 접근할때는 loc구.. 인덱스에 접근할 때에는 iloc

In [43]:
# 열추가 
exam_data = {'이름' : [ '서준', '우현', '인아'],
'수학' : [ 90, 80, 70],
'영어' : [ 98, 89, 95],
'음악' : [ 85, 95, 100],
'체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)
print(df)
print('\n')
# 데이터프레임 df에 '국어' 점수 열(column)을 추가. 
df['국어'] = 80
print(df)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90


   이름  수학  영어   음악   체육  국어
0  서준  90  98   85  100  80
1  우현  80  89   95   90  80
2  인아  70  95  100   90  80

In [44]:
df

   이름  수학  영어   음악   체육  국어
0  서준  90  98   85  100  80
1  우현  80  89   95   90  80
2  인아  70  95  100   90  80

In [45]:
df.set_index('이름', inplace=True)

In [46]:
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80

In [47]:
#시리즈들 끼리 계산이 가능하다 !! 
df['총점'] = df['수학'] + df['영어']

In [48]:
df

    수학  영어   음악   체육  국어   총점
이름
서준  90  98   85  100  80  188
우현  80  89   95   90  80  169
인아  70  95  100   90  80  165

In [49]:
df.T

이름   서준   우현   인아
수학   90   80   70
영어   98   89   95
음악   85   95  100
체육  100   90   90
국어   80   80   80
총점  188  169  165

In [55]:
#파일 입력
df = pd.read_csv('C:/Users/dkfl4/OneDrive/바탕 화면/csv_sample.csv', encoding='utf-8')

In [56]:
df

   c0  c1  c2  c3
0   0   1   4   7
1   1   2   5   8
2   2   3   6   9

In [57]:
df2 = pd.read_csv('C:/Users/dkfl4/OneDrive/바탕 화면/csv_sample.csv', encoding='utf-8', header=None)

In [58]:
df2

    0   1   2   3
0  c0  c1  c2  c3
1   0   1   4   7
2   1   2   5   8
3   2   3   6   9

use_col이 뭔지 알아보기

In [68]:
df = pd.read_csv('C:/Users/dkfl4/py_test/2021빅리더/data/auto-mpg.csv')

In [72]:
df.columns = ['mpg','cylinders','displacement',
'horsepower','weight', 'acceleration','model year','origin','name']

In [73]:
df

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,name
0,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320
1,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite
2,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst
3,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino
4,15.0,8,429.0,198.0,4341.0,10.0,70,1,ford galaxie 500
...,...,...,...,...,...,...,...,...,...
392,27.0,4,140.0,86.00,2790.0,15.6,82,1,ford mustang gl
393,44.0,4,97.0,52.00,2130.0,24.6,82,2,vw pickup
394,32.0,4,135.0,84.00,2295.0,11.6,82,1,dodge rampage
395,28.0,4,120.0,79.00,2625.0,18.6,82,1,ford ranger
396,31.0,4,119.0,82.00,2720.0,19.4,82,1,chevy s-10

In [74]:
df['origin'].value_counts()

1    248
3     79
2     70
Name: origin, dtype: int64

In [75]:
df['origin'].unique()

array([1, 3, 2], dtype=int64)

In [76]:
df.corr()

,mpg,cylinders,displacement,weight,acceleration,model year,origin
mpg,1.000000,-0.775412,-0.803972,-0.831558,0.419133,0.578667,0.562894
cylinders,-0.775412,1.000000,0.950718,0.896623,-0.503016,-0.344729,-0.561796
displacement,-0.803972,0.950718,1.000000,0.932957,-0.542083,-0.367470,-0.608749
weight,-0.831558,0.896623,0.932957,1.000000,-0.416488,-0.305150,-0.580552
acceleration,0.419133,-0.503016,-0.542083,-0.416488,1.000000,0.284376,0.204102
model year,0.578667,-0.344729,-0.367470,-0.305150,0.284376,1.000000,0.178441
origin,0.562894,-0.561796,-0.608749,-0.580552,0.204102,0.178441,1.000000

In [77]:
df[['mpg','weight']].corr()

             mpg    weight
mpg     1.000000 -0.831558
weight -0.831558  1.000000